DataProcessors/МониторСверкиСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МониторСверкиСКонтрагентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВариантыПолучателяЗапросаСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПолучателяЗапросаСверки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КонтактноеЛицоСРолью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойEmail</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыЗапросаСверкиЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыЗапросаСверкиЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтправитьАктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиРассылкиЗапросовНаСверку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиРассылкиЗапросовНаСверку</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьПолныеНазванияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрашиватьОригиналы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазбитьПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаПоЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗапросаСверкиЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСверкиРасчетовСКонтрагентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматыВложенийАктаСверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматыВложенийНеПолученыОригиналы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВложенияТекстаШаблона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МониторСверкиСКонтрагентами/Forms/ПомощникРассылки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект,
		Параметры,
		СтрЗаменить("Организация, ДатаНачала, ДатаОкончания, НастройкаРассылки, Контрагент, НаименованиеКонтрагента,
		|АдресДанныхКонтрагента, ПредварительныйПросмотр, УчетнаяЗапись, ВариантПолучателя, РольКонтактногоЛица",
		Символы.ПС, " "));
	
	Если Не ЗначениеЗаполнено(НастройкаРассылки)
		 И ПравоДоступа("Добавление", Метаданные.Справочники.НастройкиРассылкиЗапросовНаСверку) Тогда
		НастройкаРассылки = Справочники.НастройкиРассылкиЗапросовНаСверку.НастройкаПоУмолчанию(Организация);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		УчетнаяЗапись = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("УчетнаяЗаписьЭлектроннойПочты");
		Если Не ЗначениеЗаполнено(УчетнаяЗапись)
			 Или Не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись, Истина) Тогда
			// Учетная запись в персональных настройках не указана, выбираем первую доступную
			УчетнаяЗапись = УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	// Закэшируем шаблоны заголовков для некоторых элементов. Впоследствии заголовки могут обновляться на основе
	// этих шаблонов.
	ЗаголовкиЭлементов = Новый Соответствие;
	ЗаголовкиЭлементов.Вставить(Элементы.ОтправительПодсказка.Имя, Элементы.ОтправительПодсказка.Заголовок);
	ЗаголовкиЭлементов.Вставить(Элементы.ПолучательПодсказка.Имя, Элементы.ПолучательПодсказка.Заголовок);
	ЗаголовкиЭлементов.Вставить(Элементы.НадписьНастроитьЗагрузкуПочты.Имя, Элементы.НадписьНастроитьЗагрузкуПочты.Заголовок);
	ЗаголовкиЭлементов.Вставить(Элементы.НадписьИнформацияНастройка.Имя, Элементы.НадписьИнформацияНастройка.Заголовок);
	
	ШаблоныЗаголовковЭлементов = Новый ФиксированноеСоответствие(ЗаголовкиЭлементов);
	
	Элементы.НадписьКонтрагент.Заголовок = НаименованиеКонтрагента;
	Элементы.НадписьИнформацияНастройка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		Элементы.НадписьИнформацияНастройка.Заголовок,
		НаименованиеКонтрагента,
		"<img src=""ПолеВводаОткрыть"">");
	
	Элементы.ОтправительПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		Элементы.ОтправительПодсказка.Заголовок,
		СтрШаблон("<b>%1</b>", ПредставлениеОтправителяДляУчетнойЗаписи(УчетнаяЗапись)));
		
	Если Не ЗначениеЗаполнено(ВариантПолучателя) Тогда
		ВариантПолучателя = Перечисления.ВариантыПолучателяЗапросаСверки.ОсновнойEmail;
	КонецЕсли;
	
	ЗаполнитьВариантыПолучателя();
	НастроитьФормуПоВариантуПолучателя(ЭтотОбъект);
	
	Если ПредварительныйПросмотр Тогда
		
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru='Предварительный просмотр письма'");
		
		Элементы.НадписьИнформацияКонтрагент.Заголовок = НСтр("ru='Предварительный просмотр письма для:'");
		Элементы.НадписьКонтрагент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		
		Элементы.УчетнаяЗапись.Доступность = Ложь;
		Элементы.ГруппаВариантПолучателя.Доступность = Ложь;
		Элементы.ГруппаПолучательПодсказка.Видимость = Ложь;

		Элементы.НастройкаРассылки.Доступность = Ложь;
		
		Элементы.ГруппаПодсказкаЭДО.Видимость = Ложь;
		
		Элементы.ПерейтиКРассылке.КнопкаПоУмолчанию = Ложь;
		Элементы.ПерейтиКРассылке.Видимость = Ложь;
		
		Элементы.Отмена.Заголовок = НСтр("ru='Закрыть'");
		Элементы.Отмена.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
	НастроитьЭлементыВключенияЗагрузкиПочты();
	
	СформироватьПредпросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОчиститьВложения();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВариантПолучателя <> Перечисления.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РольКонтактногоЛица");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ЗначениеЗаполнено(УчетнаяЗапись)
	 	 И Не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись, Истина) Тогда
	 	ОбщегоНазначения.СообщитьПользователю(
	 		НСтр("ru = 'Почта не настроена'"),
	 		УчетнаяЗапись, "УчетнаяЗапись", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_УчетныеЗаписиЭлектроннойПочты" И Источник = УчетнаяЗапись Тогда
		
		Элементы.ОтправительПодсказка.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			ШаблоныЗаголовковЭлементов[Элементы.ОтправительПодсказка.Имя],
			СтрШаблон("<b>%1</b>", ПредставлениеОтправителяДляУчетнойЗаписи(УчетнаяЗапись)));
		
		НастроитьЭлементыВключенияЗагрузкиПочты();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	
	Элементы.ОтправительПодсказка.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		ШаблоныЗаголовковЭлементов[Элементы.ОтправительПодсказка.Имя],
		СтрШаблон("<b>%1</b>", ПредставлениеОтправителяДляУчетнойЗаписи(УчетнаяЗапись)));
	
	НастроитьЭлементыВключенияЗагрузкиПочты();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПолучателяПриИзменении(Элемент)
	НастроитьФормуПоВариантуПолучателя(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РольКонтактногоЛицаПриИзменении(Элемент)
	ЗаполнитьВариантыПолучателя();
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИнструкцияНастройкиРолиКонтактногоЛица" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Режим", "РольКонтактногоЛица");
		ОткрытьФорму("Обработка.МониторСверкиСКонтрагентами.Форма.Инструкция", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиПриИзменении(Элемент)
	
	СформироватьПредпросмотр();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НастройкаРассылки) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВерсияДанныхНастройки = ВерсияДанныхНастройки(НастройкаРассылки);
	
	ОткрытьФормуНастройки(
		"Справочник.НастройкиРассылкиЗапросовНаСверку.ФормаОбъекта",
		Элемент,
		НастройкаРассылки,
		Новый ОписаниеОповещения("НастройкаРассылкиОткрытиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуНастройки(
		"Справочник.НастройкиРассылкиЗапросовНаСверку.ФормаОбъекта",
		Элемент,
		,
		Новый ОписаниеОповещения("НастройкаРассылкиСозданиеЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаФайлНажатие(Элемент)
	
	ИндексВложения = Число(СтрЗаменить(Элемент.Имя, "КартинкаФайл", ""));
	ОткрытьФайл(ИндексВложения);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьФайлНажатие(Элемент)
	
	ИндексВложения = Число(СтрЗаменить(Элемент.Имя, "НадписьФайл", ""));
	ОткрытьФайл(ИндексВложения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьЗагрузкуПочты(Команда)
	ВключитьЗагрузкуПочтыСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКРассылке(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаРассылки",   НастройкаРассылки);
	Результат.Вставить("УчетнаяЗапись",       УчетнаяЗапись);
	Результат.Вставить("ВариантПолучателя",   ВариантПолучателя);
	Результат.Вставить("РольКонтактногоЛица", РольКонтактногоЛица);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПредставлениеОтправителяДляУчетнойЗаписи(УчетнаяЗапись)
	
	РеквизитыУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗапись, "ИмяПользователя, АдресЭлектроннойПочты");
	
	ЧастиПредставления = Новый Массив;
	
	Если ЗначениеЗаполнено(РеквизитыУчетнойЗаписи.ИмяПользователя) Тогда
		ЧастиПредставления.Добавить(РеквизитыУчетнойЗаписи.ИмяПользователя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыУчетнойЗаписи.АдресЭлектроннойПочты) Тогда
		ЧастиПредставления.Добавить(СтрШаблон("<%1>", РеквизитыУчетнойЗаписи.АдресЭлектроннойПочты));
	Иначе
		ЧастиПредставления.Добавить(НСтр(" ru='<адрес не указан>'"));
	КонецЕсли;
	
	Возврат СтрСоединить(ЧастиПредставления, " ");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВариантыПолучателя()
	
	КонтактныеДанные = РассылкаЗапросовНаСверку.РасширеннаяКонтактнаяИнформацияКонтрагента(Контрагент, РольКонтактногоЛица);
	
	СписокВыбора = Элементы.ВариантПолучателя.СписокВыбора;
	СписокВыбора.Очистить();
	
	// Основной e-mail контрагента
	Представление = Новый Массив;
	Представление.Добавить(НСтр("ru='Основному контакту или на общий e-mail'"));
	
	Если ЗначениеЗаполнено(КонтактныеДанные.АдресЭлектроннойПочтыОсновногоКонтактногоЛица) Тогда
		Представление.Добавить(
			СтрШаблон("(%1 <%2>)",
				КонтактныеДанные.ИмяОсновногоКонтактногоЛица,
				КонтактныеДанные.АдресЭлектроннойПочтыОсновногоКонтактногоЛица));
	ИначеЕсли ЗначениеЗаполнено(КонтактныеДанные.АдресЭлектроннойПочтыКонтрагента) Тогда
		Представление.Добавить(
			СтрШаблон("(%1 <%2>)",
				НаименованиеКонтрагента,
				КонтактныеДанные.АдресЭлектроннойПочтыКонтрагента));
	Иначе
		Представление.Добавить(НСтр("ru='(<не заполнен>)'"));
	КонецЕсли;
	
	СписокВыбора.Добавить(
		Перечисления.ВариантыПолучателяЗапросаСверки.ОсновнойEmail,
		СтрСоединить(Представление, " "));
	
	// e-mail контактного лица с ролью сверки
	Представление = Новый Массив;
	Представление.Добавить(НСтр("ru='Контактному лицу с указанной ролью'"));
	
	Если ЗначениеЗаполнено(КонтактныеДанные.АдресЭлектроннойПочтыКонтактногоЛицаДляСверки) Тогда
		Представление.Добавить(
			СтрШаблон("(%1 <%2>)",
				КонтактныеДанные.ИмяКонтактногоЛицаДляСверки,
				КонтактныеДанные.АдресЭлектроннойПочтыКонтактногоЛицаДляСверки));
	ИначеЕсли Не ЗначениеЗаполнено(РольКонтактногоЛица) И ПредварительныйПросмотр Тогда
		Представление.Добавить(НСтр("ru='(<не указана роль>)'"));
	ИначеЕсли Не ЗначениеЗаполнено(РольКонтактногоЛица) Тогда
		Представление.Добавить(НСтр("ru='(<укажите роль>)'"));
	Иначе
		Представление.Добавить(НСтр("ru='(<не найдено>)'"));
	КонецЕсли;
	
	СписокВыбора.Добавить(
		Перечисления.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью,
		СтрСоединить(Представление, " "));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьФормуПоВариантуПолучателя(Форма)
	
	ВариантПолучателя = Форма.ВариантПолучателя;
	ПредварительныйПросмотр = Форма.ПредварительныйПросмотр;
	Элементы = Форма.Элементы;
	
	Элементы.РольКонтактногоЛица.Видимость = 
		(ВариантПолучателя = ПредопределенноеЗначение("Перечисление.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью"))
		И (Не ПредварительныйПросмотр Или ЗначениеЗаполнено(Форма.РольКонтактногоЛица));
	
	Если Не ПредварительныйПросмотр
		 И ВариантПолучателя = ПредопределенноеЗначение("Перечисление.ВариантыПолучателяЗапросаСверки.КонтактноеЛицоСРолью") Тогда
		
		Элементы.ПолучательПодсказка.Заголовок = Форма.ШаблоныЗаголовковЭлементов[Элементы.ПолучательПодсказка.Имя];
		
	ИначеЕсли Не ПредварительныйПросмотр Тогда
	
		Элементы.ПолучательПодсказка.Заголовок = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(
			СтрЗаменить(НСтр("ru='Если не указано основное контактное лицо,
			|то будет взят адрес e-mail из карточки контрагента'"), Символы.ПС, " "));
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПредпросмотр()
	
	Если Не ЗначениеЗаполнено(НастройкаРассылки) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКонтрагента = ПолучитьИзВременногоХранилища(АдресДанныхКонтрагента);
	
	Если ТаблицаКонтрагента.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Новый Массив;
	
	ОбщиеПараметрыСверки = Обработки.МониторСверкиСКонтрагентами.ОбщиеПараметрыСверки(Организация, ДатаНачала, ДатаОкончания);
	
	КонтекстРассылки = РассылкаЗапросовНаСверку.НовыйКонтекстРассылки();
	КонтекстРассылки.НастройкаРассылки   = НастройкаРассылки;
	КонтекстРассылки.УчетнаяЗапись       = УчетнаяЗапись;
	КонтекстРассылки.ВариантПолучателя   = ВариантПолучателя;
	КонтекстРассылки.РольКонтактногоЛица = РольКонтактногоЛица;

	ПолучателиРассылки = РассылкаЗапросовНаСверку.ПолучателиРассылки(ТаблицаКонтрагента);
	РассылкаЗапросовНаСверку.ЗаполнитьСообщенияПолучателямРассылки(
		ПолучателиРассылки, КонтекстРассылки, ОбщиеПараметрыСверки, Ошибки);

	Если Ошибки.Количество() Тогда
		ТекстОшибок = СтрШаблон(Нстр("ru = 'При подготовке предпросмотра возникли ошибки:
			|%1'"),
			СтрСоединить(Ошибки, Символы.ПС));
		ВызватьИсключение ТекстОшибок;
	КонецЕсли;
	
	ПолучателиРассылки.Колонки.Контрагент.Имя = "Получатель";
	ПолучательРассылки = ПолучателиРассылки[0];
	
	СоставНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		НастройкаРассылки,
		"ПорядокСверки, ЗапрашиватьОригиналы, СпособЗапросаПоЭДО, ФорматыВложенийАктаСверки, "
		+ "ФорматыВложенийНеПолученыОригиналы, ВложенияТекстаШаблона");
	
	ТемаПисьма = ПолучательРассылки.ТемаПисьма;
	
	ВложенияТекстаШаблона = СоставНастройки.ВложенияТекстаШаблона.Получить();
	Если ВложенияТекстаШаблона = Неопределено Тогда
		ВложенияТекстаШаблона = Новый Структура;
	КонецЕсли;
	
	ТекстПисьма.УстановитьHTML(ПолучательРассылки.ТекстПисьма, ВложенияТекстаШаблона);
	
	// Отобразим вложения
	ДоступныеФорматы = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	ОчиститьВложения();
	СчетчикВложений = 0;
	
	// Если требуется приложить акт сверки к письму, но акт еще не создан, то здесь его не создаем.
	// При этом показываем, что такое вложение в письме будет.
	Если РассылкаЗапросовНаСверку.ТребуетсяАктСверкиПисьмом(ПолучательРассылки, СоставНастройки)
		 И Не ЗначениеЗаполнено(ПолучательРассылки.АктСверки) Тогда
		
		ФорматыАктаСверки = СоставНастройки.ФорматыВложенийАктаСверки.Получить();
		Если Не ЗначениеЗаполнено(ФорматыАктаСверки) Тогда
			ФорматыАктаСверки = Новый Массив;
		КонецЕсли;
		
		Для Каждого ТипФайла Из ФорматыАктаСверки Цикл
			
			СчетчикВложений = СчетчикВложений + 1;
			НоваяСтрокаВложений = Вложения.Добавить();
			
			НоваяСтрокаВложений.Представление = Нстр("ru='Акт сверки расчетов'");
			
			Картинка = Новый Картинка;
			
			СтрокаФормата = ДоступныеФорматы.Найти(ТипФайла, "ТипФайлаТабличногоДокумента");
			
			Если СтрокаФормата <> Неопределено Тогда
				Картинка = СтрокаФормата.Картинка;
				НоваяСтрокаВложений.Расширение = СтрокаФормата.Расширение;
			КонецЕсли;
			
			ВывестиЭлементыВложения(СчетчикВложений - 1, НоваяСтрокаВложений.Представление, Картинка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Показываем реально существующие вложения
	Для Каждого Вложение Из РассылкаЗапросовНаСверку.СформироватьВложенияПисьма(
		 ПолучательРассылки, СоставНастройки, ОбщиеПараметрыСверки) Цикл
		
		СчетчикВложений = СчетчикВложений + 1;
		НоваяСтрокаВложений = Вложения.Добавить();
		
		НоваяСтрокаВложений.Представление = Вложение.Представление;
		НоваяСтрокаВложений.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(
			Вложение.ДвоичныеДанные, УникальныйИдентификатор);
		
		Картинка = Новый Картинка;
		СтрокаФормата = ДоступныеФорматы.Найти(Вложение.ТипФайла);
		Если СтрокаФормата <> Неопределено Тогда
			Картинка = СтрокаФормата.Картинка;
			НоваяСтрокаВложений.Расширение = СтрокаФормата.Расширение;
		КонецЕсли;
		
		ВывестиЭлементыВложения(СчетчикВложений - 1, Вложение.Представление, Картинка);
		
	КонецЦикла;
	
	Элементы.НадписьБезВложений.Видимость = (СчетчикВложений = 0);
	Элементы.ГруппаФайл0.Видимость = (СчетчикВложений > 0);
	
	// Могли остаться лишние элементы формы - удалим их
	ИндексГруппыКУдалению = СчетчикВложений;
	ЭлементКУдалению = Элементы.Найти("ГруппаФайл" + ИндексГруппыКУдалению);
	Пока ИндексГруппыКУдалению > 0 И ЭлементКУдалению <> Неопределено Цикл
		Элементы.Удалить(ЭлементКУдалению);
		ИндексГруппыКУдалению = ИндексГруппыКУдалению + 1;
		ЭлементКУдалению = Элементы.Найти("ГруппаФайл" + ИндексГруппыКУдалению);
	КонецЦикла;
	
	Если НастройкиЭДО.ИспользуетсяОбменЭлектроннымиДокументами() И Не ПредварительныйПросмотр Тогда
		
		Элементы.ГруппаПодсказкаЭДО.Видимость = Истина;
		
		ТекстЗаголовка = "";
		
		Если СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьАктСверки Тогда
			ТекстЗаголовка =
				НСтр("ru='Если в списке рассылки есть контрагенты с настроенным <b>ЭДО</b>, то вместо письма им будут отправлены акты сверки по ЭДО'");
		ИначеЕсли СоставНастройки.СпособЗапросаПоЭДО = Перечисления.СпособыЗапросаСверкиЭДО.ОтправитьПисьмо Тогда
			ТекстЗаголовка =
				НСтр("ru='Всем выбранным контрагентам (включая тех, у кого настроен <b>ЭДО</b>) будут отправлены аналогичные письма по e-mail'");
		Иначе
			// Не отправлять
			ТекстЗаголовка =
				НСтр("ru='Контрагентам с настроенным <b>ЭДО</b> запросы на сверку отправлены не будут'");
		КонецЕсли;
		
		Элементы.СпособРассылкиПоЭДО.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстЗаголовка);
		
	Иначе
		Элементы.ГруппаПодсказкаЭДО.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиЭлементыВложения(ИндексГруппы, НаименованиеФайла, Картинка)
	
	Если ИндексГруппы > 0 И Элементы.Найти("ГруппаФайл" + ИндексГруппы) = Неопределено Тогда
		СкопироватьЭлементФормыРекурсивно(Элементы.ГруппаФайл0, Элементы.ГруппаВложенияСписок, ИндексГруппы);
	КонецЕсли;
	
	Элементы["КартинкаФайл" + ИндексГруппы].Картинка = Картинка;
	Элементы["НадписьФайл" + ИндексГруппы].Заголовок = НаименованиеФайла;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьЭлементФормыРекурсивно(Знач ЭлементИсточник, Родитель, ИндексГруппы)
	
	// ЭлементИсточник - это всегда элемент с 0 в имени.
	ИмяНовогоЭлемента = СтрЗаменить(ЭлементИсточник.Имя, "0", ИндексГруппы);
	НовыйЭлемент = СкопироватьЭлементФормы(ЭлементИсточник, Родитель, ИмяНовогоЭлемента);
	
	Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаФормы") Тогда
		Для каждого ПодчиненныйЭлемент Из ЭлементИсточник.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормыРекурсивно(ПодчиненныйЭлемент, НовыйЭлемент, ИндексГруппы);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СкопироватьЭлементФормы(ЭлементИсточник, Родитель, ИмяНовогоЭлемента)

	ТипИсточника = ТипЗнч(ЭлементИсточник);
	НовыйЭлемент = Элементы.Добавить(ИмяНовогоЭлемента, ТипИсточника, Родитель);
	НовыйЭлемент.Вид = ЭлементИсточник.Вид;

	Если ТипИсточника = Тип("ГруппаФормы") Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементИсточник,, "ПутьКДаннымЗаголовка");
	Иначе
		// Например, декорация формы
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементИсточник);
		// Копируем обработчик события "Нажатие" (другие не используются)
		ДействиеНажатие = ЭлементИсточник.ПолучитьДействие("Нажатие");
		Если ДействиеНажатие <> "" Тогда
			НовыйЭлемент.УстановитьДействие("Нажатие", ДействиеНажатие);
		КонецЕсли;
	КонецЕсли;
	
	НовыйЭлемент.Видимость = Истина;

	Возврат НовыйЭлемент;

КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(ИндексВложения)
	
	СтрокаВложения = Вложения[ИндексВложения];
	
	Если Не ЗначениеЗаполнено(СтрокаВложения.АдресВоВременномХранилище) Тогда
		// Это вложение акта сверки "для примера"
		ПоказатьПредупреждение(, НСтр("ru = 'Акт сверки расчетов будет создан непосредственно при запуске рассылки'"));
		Возврат;
	КонецЕсли;
	
	Если НРег(СтрокаВложения.Расширение) = НРег("mxl") Тогда
		
		ПараметрыФормы = СтандартныеПодсистемыКлиент.ПараметрыРедактораТабличногоДокумента();
		ПараметрыФормы.ИмяДокумента = СтрокаВложения.Представление;
		СтандартныеПодсистемыКлиент.ПоказатьРедакторТабличногоДокумента(
			СтрокаВложения.АдресВоВременномХранилище, ПараметрыФормы);
		
		Возврат;
		
	КонецЕсли;
	
	// Открыть файл
	ФайловаяСистемаКлиент.ОткрытьФайл(СтрокаВложения.АдресВоВременномХранилище,, СтрокаВложения.Представление);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВложения()
	
	Для Каждого Вложение Из Вложения Цикл
		
		Если Не ЗначениеЗаполнено(Вложение.АдресВоВременномХранилище) Тогда
			Продолжить;
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(Вложение.АдресВоВременномХранилище);
		Если ЗначениеЗаполнено(Вложение.ПутьКФайлу) Тогда
			ВременныйФайл = Новый Файл(Вложение.ПутьКФайлу);
			Если ВременныйФайл.Существует() Тогда
				ФайловаяСистема.УдалитьВременныйФайл(Вложение.ПутьКФайлу);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	Вложения.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ИмяФормы, Элемент, НастройкаРассылки = Неопределено, ОповещениеПриЗакрытии = Неопределено)
	
	ДополнительныеПараметрыФормы = Новый Структура;
	ДополнительныеПараметрыФормы.Вставить("Организация", Организация);
	ДополнительныеПараметрыФормы.Вставить("ДатаНачала", ДатаНачала);
	ДополнительныеПараметрыФормы.Вставить("ДатаОкончания", ДатаОкончания);
	ДополнительныеПараметрыФормы.Вставить("АдресДанныхКонтрагента", АдресДанныхКонтрагента);
	ДополнительныеПараметрыФормы.Вставить("НаименованиеКонтрагента", НаименованиеКонтрагента);
	
	Если ОповещениеПриЗакрытии <> Неопределено Тогда
		ОткрытьФорму(ИмяФормы,
			Новый Структура("Ключ, ДополнительныеПараметры", НастройкаРассылки, ДополнительныеПараметрыФормы),
			Элемент,
			,
			,
			,
			ОповещениеПриЗакрытии);
	Иначе
		ОткрытьФорму(ИмяФормы,
			Новый Структура("Ключ, ДополнительныеПараметры", НастройкаРассылки, ДополнительныеПараметрыФормы),
			Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиОткрытиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ВерсияДанныхНастройки(НастройкаРассылки) <> ВерсияДанныхНастройки Тогда
		// Настройка изменена
		СформироватьПредпросмотр();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаРассылкиСозданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаРассылки = Результат;
		СформироватьПредпросмотр();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВерсияДанныхНастройки(НастройкаРассылки)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаРассылки, "ВерсияДанных");
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыВключенияЗагрузкиПочты()
	
	Если ПредварительныйПросмотр Тогда
		Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты) Тогда
		Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись)
		 Или Не РаботаСПочтовымиСообщениями.УчетнаяЗаписьНастроена(УчетнаяЗапись, Истина) Тогда
		// Сначала нужно настроить учетную запись
		Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	УчетныеЗаписиДляЗагрузкиПисем = УчетныеЗаписиДляЗагрузкиПисем();
	
	СтрокаТекущейУчетнойЗаписи = УчетныеЗаписиДляЗагрузкиПисем.Найти(УчетнаяЗапись, "Ссылка");
	УчетнаяЗаписьНастроена = (СтрокаТекущейУчетнойЗаписи <> Неопределено);
	
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьПочтовыйКлиент = ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент");
	ВключеноРеглЗадание = ОбщегоНазначения.РазделениеВключено() // в разделенном режиме регл задание включено всегда
		Или РегламентныеЗаданияСервер.ПараметрРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем, "Использование", Ложь);
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроверятьПраваАдминистрированияСистемы = Истина;
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ПроверятьПраваАдминистрированияСистемы = Ложь;
	КонецЕсли;
	
	// Если настройка не требуется или недоступна, то скрываем группу
	Если ВключеноРеглЗадание И УчетнаяЗаписьНастроена И ИспользоватьПочтовыйКлиент
		 Или Не ВключеноРеглЗадание И Не Пользователи.ЭтоПолноправныйПользователь(, ПроверятьПраваАдминистрированияСистемы)
		 Или Не ИспользоватьПочтовыйКлиент И Не ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьПочтовыйКлиент) Тогда
		Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	АдресаЭлектроннойПочты = Новый Массив;
	
	Если УчетнаяЗаписьНастроена Тогда
		// Возьмем адрес текущей учетной записи, а саму запись удалим - ниже сообщим о других адресах, с которых также будут загружены письма
		АдресаЭлектроннойПочты.Добавить(СтрШаблон("<b>%1</b>", СтрокаТекущейУчетнойЗаписи.АдресЭлектроннойПочты));
		УчетныеЗаписиДляЗагрузкиПисем.Удалить(СтрокаТекущейУчетнойЗаписи);
	Иначе
		АдресаЭлектроннойПочты.Добавить(СтрШаблон("<b>%1</b>", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "АдресЭлектроннойПочты")));
	КонецЕсли;
	
	Если УчетныеЗаписиДляЗагрузкиПисем.Количество() > 1 Тогда
		// Перечень вида "abc@mail.ru, def@ya.ru и ghi@company.com"
		СписокЧерезЗапятую = Новый Массив;
		Для ИндексЗаписи = 0 По УчетныеЗаписиДляЗагрузкиПисем.Количество() - 2 Цикл // цикл с первой по предпоследнюю запись
			СписокЧерезЗапятую.Добавить(УчетныеЗаписиДляЗагрузкиПисем[ИндексЗаписи].АдресЭлектроннойПочты);
		КонецЦикла;
		АдресаЭлектроннойПочты.Добавить(
			СтрШаблон(Нстр("ru = '(а также на %1 и %2)'"),
			СтрСоединить(СписокЧерезЗапятую, ", "),
			УчетныеЗаписиДляЗагрузкиПисем[УчетныеЗаписиДляЗагрузкиПисем.Количество() - 1].АдресЭлектроннойПочты));
	ИначеЕсли УчетныеЗаписиДляЗагрузкиПисем.Количество() = 1 Тогда
		АдресаЭлектроннойПочты.Добавить(СтрШаблон(Нстр("ru = '(а также на %1)'"), УчетныеЗаписиДляЗагрузкиПисем[0].АдресЭлектроннойПочты));
	КонецЕсли;
	
	ПоясняющийТекст = СтрШаблон(
		ШаблоныЗаголовковЭлементов[Элементы.НадписьНастроитьЗагрузкуПочты.Имя],
		СтрСоединить(АдресаЭлектроннойПочты, " "));
	
	Элементы.НадписьНастроитьЗагрузкуПочты.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ПоясняющийТекст);
	Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьЗагрузкуПочтыСервер()
	
	УчетныеЗаписиДляЗагрузкиПисем = УчетныеЗаписиДляЗагрузкиПисем();
	
	СтрокаТекущейУчетнойЗаписи = УчетныеЗаписиДляЗагрузкиПисем.Найти(УчетнаяЗапись, "Ссылка");
	УчетнаяЗаписьНастроена = (СтрокаТекущейУчетнойЗаписи <> Неопределено);
	ИспользоватьПочтовыйКлиент = ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент");
	ВключеноРеглЗадание = ОбщегоНазначения.РазделениеВключено() // в разделенном режиме регл задание включено всегда
		Или РегламентныеЗаданияСервер.ПараметрРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем, "Использование", Ложь);
	
	Если ВключеноРеглЗадание И УчетнаяЗаписьНастроена И ИспользоватьПочтовыйКлиент Тогда
		Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не УчетнаяЗаписьНастроена Тогда
			
			Если Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "ИспользоватьДляПолучения") Тогда
				УчетнаяЗаписьОбъект = УчетнаяЗапись.ПолучитьОбъект();
				УчетнаяЗаписьОбъект.ИспользоватьДляПолучения = Истина;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(УчетнаяЗаписьОбъект);
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УчетнаяЗаписьЭлектроннойПочты = УчетнаяЗапись;
			МенеджерЗаписи.Прочитать();
			
			Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.НеИспользоватьВоВстроенномПочтовомКлиенте Тогда
				МенеджерЗаписи.НеИспользоватьВоВстроенномПочтовомКлиенте = Ложь;
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
		
		КонецЕсли;
		
		Если Не ИспользоватьПочтовыйКлиент Тогда
			Взаимодействия.УстановитьИспользованиеПочтовогоКлиента(Истина);
		КонецЕсли;
		
		Если Не ВключеноРеглЗадание Тогда
			РегламентныеЗаданияСервер.УстановитьПараметрыРегламентногоЗадания(
				Метаданные.РегламентныеЗадания.ПолучениеИОтправкаЭлектронныхПисем, Новый Структура("Использование", Истина));
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Элементы.ГруппаНастроитьЗагрузкуПочты.Видимость = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УчетныеЗаписиДляЗагрузкиПисем()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка,
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты КАК НастройкиУчетныхЗаписейЭлектроннойПочты
	|		ПО НастройкиУчетныхЗаписейЭлектроннойПочты.УчетнаяЗаписьЭлектроннойПочты = УчетныеЗаписиЭлектроннойПочты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоследнейЗагрузкиПочтовыхСообщений КАК ДатыПоследнейЗагрузкиПочтовыхСообщений
	|		ПО ДатыПоследнейЗагрузкиПочтовыхСообщений.УчетнаяЗапись = УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения
	|	И НЕ ЕСТЬNULL(НастройкиУчетныхЗаписейЭлектроннойПочты.НеИспользоватьВоВстроенномПочтовомКлиенте, ЛОЖЬ)
	|	И УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты <> """"
	|	И УчетныеЗаписиЭлектроннойПочты.СерверВходящейПочты <> """"
	|	И НЕ УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления";
	
	// Для полноты информирования пользователя выбираем все учетные записи, на которые повлияет включение загрузки почты
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
